# HybridElementImport Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImporterIFC..::..HybridElementImport Method
ImporterIFC Class See Also
---
Imports IFC Elements using non-open-source framework.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<ElementId> HybridElementImport(
	Document doc,
	string file
)
```

Visual Basic
---
```text
Public Function HybridElementImport ( _
	doc As Document, _
	file As String _
) As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ HybridElementImport(
	Document^ doc,
	String^ file
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document Document into which Import is done.
file
    Type: System..::..String Full path of the file to import.
# ### Return Value
Elements imported using non-open-source framework.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace